{
	"fullstack": "DESARROLLADOR FULLSTACK",
	"webDeveloper": "DESARROLLADOR WEB",
	"juniorDeveloper": "DESARROLLADOR JUNIOR",
	"gelita": {
		"date": "Septiembre 2024 - Actualmente",
		"description": "Soy responsable de la adaptación y actualización de un sistema de control de procesos para la producción de grenetina, preparándolo para su implementación en una nueva planta. Mi enfoque está en garantizar la eficiencia operativa y facilitar la integración del sistema en ambas ubicaciones, mejorando el registro y llenado de bitácoras de producción. Este proceso optimiza la gestión de los datos y mejora la trazabilidad de los procesos, lo que contribuye a una mayor calidad y eficiencia en la producción."
	},
	"sicap": {
		"date": "Febrero 2024 - Octubre 2024",
		"description": "Contribuí al desarrollo y optimización de un sistema de caja financiera para una entidad financiera en México, asegurando el cumplimiento de las regulaciones. Utilicé PHP y JavaScript para mejorar las operaciones del sistema, lo que resultó en un aumento significativo en la velocidad de procesamiento y la experiencia del usuario. Mi trabajo llevó a un servicio más eficiente y ágil, optimizando el rendimiento general del sistema."
	},
	"freelancer": {
		"date": "Enero 2024 - Octubre 2024",
		"description": "Diseñé y desarrollé sitios web modernos para pequeños negocios y eventos, enfocándome en rendimiento, diseño responsivo y experiencia de usuario. Utilicé React, Astro y TailwindCSS para crear interfaces rápidas y accesibles, e integré Supabase como backend para manejar bases de datos y autenticación. Entregué soluciones funcionales y atractivas que ayudaron a mis clientes a mejorar su presencia en línea y gestionar sus servicios de manera más eficiente."
	},
	"cisi": {
		"date": "Enero 2023 - Febrero 2024",
		"description": "Migré una aplicación web de préstamos financieros de PHP heredado a Django, JavaScript y Bootstrap, logrando una interfaz más moderna, rápida y estable. Me enfoqué en mejorar la experiencia del usuario y reducir los tiempos de carga. Además, implementé la generación automática de reportes en PDF y desarrollé un sistema de análisis predictivo de riesgo crediticio utilizando Pandas y Scikit-learn, optimizando la toma de decisiones financieras."
	}
}
